<html>

<head>
<meta http-equiv=Content-Type content="text/html; charset=windows-1252">
<meta name=Generator content="Microsoft Word 12 (filtered)">
<style>
<!--
 /* Font Definitions */
 @font-face
	{font-family:Wingdings;
	panose-1:5 0 0 0 0 0 0 0 0 0;}
@font-face
	{font-family:"Cambria Math";
	panose-1:2 4 5 3 5 4 6 3 2 4;}
@font-face
	{font-family:Calibri;
	panose-1:2 15 5 2 2 2 4 3 2 4;}
@font-face
	{font-family:Tahoma;
	panose-1:2 11 6 4 3 5 4 4 2 4;}
 /* Style Definitions */
 p.MsoNormal, li.MsoNormal, div.MsoNormal
	{margin-top:0in;
	margin-right:0in;
	margin-bottom:10.0pt;
	margin-left:0in;
	text-align:justify;
	line-height:150%;
	font-size:13.0pt;
	font-family:"Times New Roman","serif";}
h1
	{mso-style-link:"Heading 1 Char";
	margin-top:12.0pt;
	margin-right:0in;
	margin-bottom:3.0pt;
	margin-left:0in;
	text-align:justify;
	line-height:150%;
	page-break-after:avoid;
	font-size:20.0pt;
	font-family:"Arial","sans-serif";}
h2
	{mso-style-link:"Heading 2 Char";
	margin-top:12.0pt;
	margin-right:0in;
	margin-bottom:3.0pt;
	margin-left:0in;
	text-align:justify;
	line-height:150%;
	page-break-after:avoid;
	font-size:16.0pt;
	font-family:"Arial","sans-serif";}
p.MsoCaption, li.MsoCaption, div.MsoCaption
	{margin-top:0in;
	margin-right:0in;
	margin-bottom:10.0pt;
	margin-left:0in;
	text-align:justify;
	line-height:150%;
	font-size:10.0pt;
	font-family:"Times New Roman","serif";
	font-weight:bold;}
a:link, span.MsoHyperlink
	{color:blue;
	text-decoration:underline;}
a:visited, span.MsoHyperlinkFollowed
	{color:purple;
	text-decoration:underline;}
p.MsoAcetate, li.MsoAcetate, div.MsoAcetate
	{mso-style-link:"Balloon Text Char";
	margin:0in;
	margin-bottom:.0001pt;
	text-align:justify;
	font-size:8.0pt;
	font-family:"Tahoma","sans-serif";}
p.MsoListParagraph, li.MsoListParagraph, div.MsoListParagraph
	{margin-top:0in;
	margin-right:0in;
	margin-bottom:10.0pt;
	margin-left:.5in;
	text-align:justify;
	line-height:150%;
	font-size:13.0pt;
	font-family:"Times New Roman","serif";}
p.MsoListParagraphCxSpFirst, li.MsoListParagraphCxSpFirst, div.MsoListParagraphCxSpFirst
	{margin-top:0in;
	margin-right:0in;
	margin-bottom:0in;
	margin-left:.5in;
	margin-bottom:.0001pt;
	text-align:justify;
	line-height:150%;
	font-size:13.0pt;
	font-family:"Times New Roman","serif";}
p.MsoListParagraphCxSpMiddle, li.MsoListParagraphCxSpMiddle, div.MsoListParagraphCxSpMiddle
	{margin-top:0in;
	margin-right:0in;
	margin-bottom:0in;
	margin-left:.5in;
	margin-bottom:.0001pt;
	text-align:justify;
	line-height:150%;
	font-size:13.0pt;
	font-family:"Times New Roman","serif";}
p.MsoListParagraphCxSpLast, li.MsoListParagraphCxSpLast, div.MsoListParagraphCxSpLast
	{margin-top:0in;
	margin-right:0in;
	margin-bottom:10.0pt;
	margin-left:.5in;
	text-align:justify;
	line-height:150%;
	font-size:13.0pt;
	font-family:"Times New Roman","serif";}
span.Heading1Char
	{mso-style-name:"Heading 1 Char";
	mso-style-link:"Heading 1";
	font-family:"Arial","sans-serif";
	font-weight:bold;}
span.Heading2Char
	{mso-style-name:"Heading 2 Char";
	mso-style-link:"Heading 2";
	font-family:"Arial","sans-serif";
	font-weight:bold;}
span.BalloonTextChar
	{mso-style-name:"Balloon Text Char";
	mso-style-link:"Balloon Text";
	font-family:"Tahoma","sans-serif";}
.MsoPapDefault
	{margin-bottom:10.0pt;
	line-height:115%;}
@page Section1
	{size:8.5in 11.0in;
	margin:1.0in 1.0in 1.0in 1.0in;}
div.Section1
	{page:Section1;}
 /* List Definitions */
 ol
	{margin-bottom:0in;}
ul
	{margin-bottom:0in;}
-->
</style>

</head>

<body lang=EN-US link=blue vlink=purple>

<div class=Section1>

<h1><a name="_Toc296332983"></a><a name="_Toc293406780"></a><a
name="_Toc288852017"></a><a name="_Toc293392668"></a><a name="_Toc293307417"></a><a
name="_Toc293305615"></a><a name="_Toc291771602"></a><a name="_Toc290651719"></a><a
name="_Toc288655303"></a><a name="_Toc287864359">Ch&#432;&#417;ng 1. M&#7902;
&#272;&#7846;U</a></h1>

<p class=MsoNormal><a href="#_1.1._Lý_do">1.1. Lý do c&#7847;n &#273;&#7871;n
mã dòng hi&#7879;n nay</a></p>

<p class=MsoNormal><a href="#_1.2._M&#7909;c_tiêu">1.2. M&#7909;c tiêu c&#7911;a
&#273;&#7873; tài</a></p>

<p class=MsoNormal><a href="#_1.3._Yêu_c&#7847;u">1.3. Yêu c&#7847;u c&#7911;a
&#273;&#7873; tài</a></p>

<p class=MsoNormal><a href="#_1.4._B&#7889;_c&#7909;c">1.4. B&#7889; c&#7909;c
lu&#7853;n v&#259;n</a></p>

<p class=MsoNormal><b>Tóm t&#7855;t ch&#432;&#417;ng:</b></p>

<p class=MsoNormal style='margin-left:.5in;text-indent:-.25in'><span
style='font-family:Symbol'><img width=15 height=15
src="CHAPTER01_files/image001.gif" alt="*"><span style='font:7.0pt "Times New Roman"'>&nbsp;&nbsp;&nbsp;&nbsp;
</span></span><i>N&#7897;i dung ch&#432;&#417;ng m&#7903; &#273;&#7847;u trình
bày lý do c&#7847;n &#273;&#7871;n mã dòng hi&#7879;n nay, m&#7909;c tiêu và
yêu c&#7847;u c&#7911;a lu&#7853;n v&#259;n. Tóm t&#7855;t c&#7911;a t&#7915;ng
ch&#432;&#417;ng s&#7869; &#273;&#432;&#7907;c trình bày trong ph&#7847;n b&#7889;
c&#7909;c lu&#7853;n v&#259;n</i>.</p>

<b><span style='font-size:16.0pt;line-height:150%;font-family:"Arial","sans-serif"'><br
clear=all style='page-break-before:always'>
</span></b>

<h2><a name="_1.1._Lý_do"></a><a name="_Toc296332984"></a><a
name="_Toc293406781"></a><a name="_Toc288852018"></a><a name="_Toc293392669"></a><a
name="_Toc293307418"></a><a name="_Toc293305616"></a><a name="_Toc291771603"></a><a
name="_Toc290651720"></a><a name="_Toc288655304"></a><a name="_Toc287881673"></a><a
name="_Toc287882850"></a><a name="_Toc287864360"></a><a name="_Toc287847504"></a><a
name="_Toc287777809"></a><a name="_Toc287860735"></a><a name="_Toc287519561"></a><a
name="_Toc287691735"></a><a name="_Toc287459703"></a><a name="_Toc287445807"></a><a
name="_Ref280433238">1.1. Lý do c&#7847;n &#273;&#7871;n mã dòng</a> hi&#7879;n
nay</h2>

<p class=MsoNormal><span style='layout-grid-mode:line'>Ngày nay v&#7899;i s&#7921;
phát tri&#7875;n v&#432;&#7907;t b&#7853;t c&#7911;a công ngh&#7879; thông tin
và truy&#7873;n thông &#273;ã &#273;em l&#7841;i r&#7845;t nhi&#7873;u nh&#7919;ng
&#7913;ng d&#7909;ng ti&#7879;n d&#7909;ng &#273;&#7871;n v&#7899;i ng&#432;&#7901;i
dùng. Xu h&#432;&#7899;ng phát tri&#7875;n c&#7911;a công ngh&#7879; hi&#7879;n
&#273;&#7841;i là trên môi tr&#432;&#7901;ng m&#7841;ng, trong &#273;ó m&#7841;ng
di &#273;&#7897;ng &#273;ang và s&#7869; có nhi&#7873;u h&#7913;a h&#7865;n.
Trong t&#432;&#417;ng lai g&#7847;n nh&#432; m&#7885;i &#7913;ng d&#7909;ng
&#273;&#7873;u có th&#7875; &#273;&#432;a lên chi&#7871;c &#273;i&#7879;n tho&#7841;i
g&#7885;n nh&#7865;. V&#7845;n &#273;&#7873; b&#7843;o m&#7853;t ngày nay không
ch&#7881; c&#7845;p bách trong m&#7841;ng internet toàn c&#7847;u, mà ngay c&#7843;
&#7903; m&#7841;ng di &#273;&#7897;ng c&#361;ng r&#7845;t c&#7847;n
&#273;&#432;&#7907;c s&#7921; quan tâm. Nhu c&#7847;u &#273;&#7843;m b&#7843;o
bí m&#7853;t khi th&#7921;c hi&#7879;n các cu&#7897;c g&#7885;i, hay các d&#7883;ch
v&#7909; thông qua m&#7841;ng di &#273;&#7897;ng là &#273;i&#7873;u mà ng&#432;&#7901;i
dùng r&#7845;t quan tâm. &#272;i&#7873;u này càng &#273;&#432;&#7907;c quan tâm
h&#417;n khi có s&#7921; xu&#7845;t hi&#7879;n thêm hàng lo&#7841;t nh&#7919;ng
công ngh&#7879; m&#7841;ng di &#273;&#7897;ng m&#7899;i nh&#432; GPRS, 3G, EPS
(LTE – SAE), …. Các công ngh&#7879; này &#273;&#7873;u do t&#7893; ch&#7913;c
3GPP công b&#7889;. D&#432;&#7899;i &#273;ây là Logo c&#7911;a t&#7893; ch&#7913;c
3GPP, &#273;&#432;&#7907;c l&#7845;y t&#7915; trang web c&#7911;a t&#7893; ch&#7913;c
(</span><a href="http://www.3gpp.org/">http://www.3gpp.org</a><span
style='layout-grid-mode:line'>):</span></p>

<p class=MsoNormal align=center style='text-align:center;page-break-after:avoid'><img
border=0 width=294 height=171 id="Picture 1" src="CHAPTER01_files/image002.jpg"
alt=1></p>

<p class=MsoCaption align=center style='text-align:center'><a
name="_Toc296333051"></a><a name="_Toc288851928"></a><a name="_Toc293392755"></a><a
name="_Toc293130249"></a><a name="_Toc291771686"></a><a name="_Toc289868577"></a><a
name="_Toc287860129"></a><a name="_Toc287882669"></a><a name="_Toc287777852"></a><a
name="_Toc287715272"></a><a name="_Toc287462760"></a><a name="_Toc287691778"></a><a
name="_Toc287462348"></a><a name="_Toc287445844"><i><span style='font-size:
13.0pt;line-height:150%;font-weight:normal'>Hình </span></i></a><i><span
style='font-size:13.0pt;line-height:150%;font-weight:normal'>1</span></i><i><span
style='font-size:13.0pt;line-height:150%;font-weight:normal'>. Logo c&#7911;a t&#7893;
ch&#7913;c 3GPP.</span></i></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>&#272;&#7875;
&#273;áp &#7913;ng các nhu c&#7847;u b&#7843;o m&#7853;t trên m&#7841;ng di
&#273;&#7897;ng thì các công ngh&#7879; di &#273;&#7897;ng &#273;&#7873;u ph&#7843;i
áp d&#7909;ng các k&#7929; thu&#7853;t mã hóa phù h&#7907;p. Trong t&#7845;t c&#7843;
các k&#7929; thu&#7853;t mã hóa, mã dòng (stream cipher) là thích h&#7907;p
&#273;&#7875; áp d&#7909;ng trong m&#7841;ng di &#273;&#7897;ng. &#272;ây là m&#7897;t
k&#7929; thu&#7853;t mã hóa thu&#7897;c lo&#7841;i mã &#273;&#7889;i x&#7913;ng
(symmetric cryptography). Vi&#7879;c b&#7843;o m&#7853;t b&#7857;ng cách dùng
mã dòng trong GSM có nh&#7919;ng m&#7909;c &#273;ích nh&#432;: mã hóa &#273;&#7843;m
b&#7843;o bí m&#7853;t d&#7919; li&#7879;u, ch&#7913;ng th&#7921;c, &#273;&#7843;m
b&#7843;o tính toàn v&#7865;n [2]. Có hai lo&#7841;i mã &#273;&#7889;i x&#7913;ng
&#273;ó là: mã kh&#7889;i (block cipher) và mã dòng (stream cipher). Trong
&#273;ó nh&#432; ta &#273;ã bi&#7871;t, mã kh&#7889;i s&#7869; làm vi&#7879;c b&#7857;ng
cách chia kh&#7889;i d&#7919; li&#7879;u c&#7847;n mã hóa ban &#273;&#7847;u
thành nh&#7919;ng kh&#7889;i d&#7919; li&#7879;u nh&#7845;t &#273;&#7883;nh,
ngh&#297;a là ph&#7843;i bi&#7871;t tr&#432;&#7899;c kích th&#432;&#7899;c
c&#361;ng nh&#432; b&#7843;n thân kh&#7889;i d&#7919; li&#7879;u &#273;ó. Các d&#7919;
li&#7879;u &#273;&#432;&#7907;c l&#432;u thông trên m&#7841;ng di &#273;&#7897;ng
&#273;i&#7875;n hình nh&#7845;t là d&#7919; li&#7879;u c&#7911;a m&#7897;t cu&#7897;c
g&#7885;i d&#432;&#7901;ng nh&#432; không &#273;&#432;&#7907;c bi&#7871;t
tr&#432;&#7899;c kích th&#432;&#7899;c, hay còn g&#7885;i là d&#7919; li&#7879;u
&#273;&#432;&#7907;c sinh ra và bi&#7871;n thiên theo th&#7901;i gian
(time-varying). Do yêu c&#7847;u x&#7917; lý tín hi&#7879;u bi&#7871;n thiên
theo th&#7901;i gian này c&#7911;a m&#7841;ng di &#273;&#7897;ng nên &#273;òi h&#7887;i
k&#7929; thu&#7853;t mã hóa áp d&#7909;ng c&#361;ng ph&#7843;i th&#7887;a mãn
c&#417; ch&#7871; này. Mã dòng ho&#7841;t &#273;&#7897;ng v&#7899;i bi&#7871;n
&#273;&#7893;i c&#7911;a nó bi&#7871;n thiên theo th&#7901;i gian trên nh&#7919;ng
kh&#7889;i b&#7843;n rõ (plaintext) riêng bi&#7879;t [1], các ph&#7847;n sau c&#7911;a
lu&#7853;n v&#259;n s&#7869; làm sáng t&#7887; chi ti&#7871;t v&#7873; kh&#7843;
n&#259;ng &#273;áp &#7913;ng &#273;&#432;&#7907;c các yêu c&#7847;u c&#7911;a
mã dòng trên m&#7841;ng di &#273;&#7897;ng. &#272;ó là lý do cho th&#7845;y <b><i>t&#7847;m
quan tr&#7885;ng c&#7911;a vi&#7879;c &#7913;ng d&#7909;ng mã dòng trong v&#7845;n
&#273;&#7873; b&#7843;o m&#7853;t &#7903; m&#7841;ng di &#273;&#7897;ng</i></b>.</span></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>Nhìn
v&#7873; quá kh&#7913;, ta th&#7845;y k&#7927; nguyên c&#7911;a mã dòng th&#7921;c
s&#7921; là vào nh&#7919;ng n&#259;m 1960. Vào th&#7901;i gian &#273;ó, r&#7845;t
nhi&#7873;u t&#7893; ch&#7913;c s&#7917; d&#7909;ng &#273;&#7871;n mã dòng
nh&#432;: nh&#7919;ng nhu c&#7847;u c&#7911;a quân &#273;&#7897;i và ngo&#7841;i
giao, các t&#7893; ch&#7913;c gián &#273;i&#7879;p, các t&#7893; ch&#7913;c
cung c&#7845;p d&#7883;ch v&#7909; vi&#7877;n thông, các doanh nghi&#7879;p,…
Nh&#7919;ng thi&#7871;t b&#7883; mã hóa &#273;i&#7879;n t&#7917; bán d&#7851;n
&#273;ã b&#7855;t &#273;&#7847;u xu&#7845;t hi&#7879;n. Do các thi&#7871;t b&#7883;
này có b&#7897; nh&#7899; v&#7899;i dung l&#432;&#7907;ng r&#7845;t th&#7845;p
nên mã dòng tr&#7903; nên ph&#7893; bi&#7871;n h&#417;n mã kh&#7889;i. Tuy
nhiên ngày nay v&#7899;i s&#7921; phát tri&#7875;n công ngh&#7879; trên các thi&#7871;t
b&#7883;, các v&#7845;n &#273;&#7873; &#273;ó không còn là tr&#7903; ng&#7841;i,
nên mã kh&#7889;i l&#7841;i chi&#7871;m &#432;u th&#7871; h&#417;n. B&#7857;ng
ch&#7913;ng là ngay c&#7843; trên n&#7873;n t&#7843;ng GSM, &#7903; th&#7871; h&#7879;
th&#7913; 3 mã kh&#7889;i Kasumi &#273;ã thay th&#7871; mã dòng A5/x &#7903; th&#7871;
h&#7879; th&#7913; 2. Trên công ngh&#7879; Wi-Fi, &#7903; phiên b&#7843;n IEEE
802.11a/b còn &#273;ang s&#7917; d&#7909;ng mã dòng RC4, nh&#432;ng sang phiên
b&#7843;n IEEE 802.11i thì &#273;&#432;&#7907;c thay th&#7871; b&#7903;i mã kh&#7889;i
AES [6].</span></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>Nh&#432;ng
không vì v&#7853;y mà mã dòng l&#7841;i không th&#7875; phát tri&#7875;n
&#273;&#432;&#7907;c. H&#7897;i th&#7843;o </span><b><i><span style='color:
black'>The State of the Art of Stream Ciphers</span></i></b><span
style='color:black'> (SASC), m&#7897;t h&#7897;i th&#7843;o chuyên v&#7873; mã
dòng &#273;&#432;&#7907;c t&#7893; ch&#7913;c b&#7903;i ECRYPT (<a
href="http://www.ecrypt.eu.org/">http://www.ecrypt.eu.org</a>), v&#7851;n
&#273;ang &#273;&#432;&#7907;c thu hút. Ông Steve Babbage (công tác t&#7841;i
Vodafone Group R&amp;D) có &#273;&#7873; c&#7853;p, mã dòng r&#7845;t h&#7919;u
d&#7909;ng vì <b><i>“t&#7889;c &#273;&#7897; r&#7845;t nhanh”</i></b>, <b><i>có
hi&#7879;u l&#7921;c và nh&#7887; g&#7885;n</i></b> &#273;&#7889;i v&#7899;i nh&#7919;ng
thi&#7871;t b&#7883; b&#7883; h&#7841;n ch&#7871; nh&#432;: nh&#7919;ng thi&#7871;t
b&#7883; có ngu&#7891;n n&#259;ng l&#432;&#7907;ng (pin) th&#7845;p nh&#432;
trong <b>RFID</b>; hay nh&#432; Smart cards (8-bit processors) [7]. Trong bài
báo c&#7911;a mình ([6]), Adi Shamir (m&#7897;t trong nh&#7919;ng ng&#432;&#7901;i
phát minh ra RSA) có &#273;&#7873; c&#7853;p, &#7913;ng d&#7909;ng m&#7853;t mã
c&#7911;a RFID &#273;&#432;&#7907;c nghiên c&#7913;u r&#7897;ng rãi &#7903; Hàn
Qu&#7889;c, ông cho r&#7857;ng nó s&#7869; là m&#7897;t công ngh&#7879; r&#7845;t
quan tr&#7885;ng và thành công trong th&#7853;p k&#7927; t&#7899;i. Và ông
c&#361;ng mong &#273;&#7907;i r&#7857;ng các &#7913;ng d&#7909;ng trên RFID này
s&#7917; d&#7909;ng mã dòng nhi&#7873;u h&#417;n là mã kh&#7889;i. Cu&#7889;i
cùng ông còn nh&#7853;n xét r&#7857;ng, tình tr&#7841;ng ki&#7871;n th&#7913;c
và s&#7921; t&#7921; tin c&#7911;a chúng ta v&#7873; mã dòng còn y&#7871;u. <b><i>Ngh&#297;a
là chúng ta hoàn toàn có th&#7875; tin t&#432;&#7903;ng vào m&#7897;t
t&#432;&#417;ng lai c&#7911;a vi&#7879;c &#7913;ng d&#7909;ng mã dòng.</i></b></span></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>Các
thu&#7853;t toán b&#7843;o m&#7853;t trong m&#7841;ng GSM xu&#7845;t phát t&#7915;
ba thu&#7853;t toán mã hóa là A3, A5 và A8. GSM s&#7917; d&#7909;ng m&#7897;t s&#7889;
thu&#7853;t toán &#273;ã có nh&#432; A5/1, A5/2 và A5/3 cho vi&#7879;c b&#7843;o
m&#7853;t. Tuy nhiên chúng có th&#7875; b&#7883; b&#7867; b&#7903;i m&#7897;t
vài các t&#7845;n công [3]. Ngày càng có thêm các th&#7871; h&#7879; m&#7899;i
c&#7911;a m&#7841;ng di d&#7897;ng, nh&#432; th&#7871; h&#7879; m&#7899;i nh&#7845;t
là công ngh&#7879; <b>EPS</b>, m&#7897;t công ngh&#7879; m&#7899;i nh&#7845;t
&#273;ang &#273;&#432;&#7907;c d&#7921; &#273;&#7883;nh phát tri&#7875;n lên
thành th&#7871; h&#7879; 4G. B&#7903;i v&#7853;y hi&#7879;n nay có nh&#7919;ng
b&#7843;n th&#7843;o v&#7873; các thu&#7853;t toán b&#7843;o m&#7853;t m&#7899;i
&#273;&#7875; &#7913;ng d&#7909;ng vào các công ngh&#7879; m&#7899;i này,
&#273;i&#7875;n hình là các b&#7843;n th&#7843;o nh&#7919;ng thu&#7853;t toán c&#7911;a
t&#7893; ch&#7913;c <b>3GPP</b> nh&#432; 128-EEA3 và 128-EIA3 cho công tác b&#7843;o
m&#7853;t trên công ngh&#7879; EPS [2].</span></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>Mã
dòng thích h&#7907;p cho vi&#7879;c hi&#7879;n th&#7921;c hóa b&#7857;ng ph&#7847;n
m&#7873;m hay ph&#7847;n c&#7913;ng. Nó r&#7845;t thích h&#7907;p &#273;&#7875;
cài &#273;&#7863;t tr&#7921;c ti&#7871;p trên các thi&#7871;t b&#7883; ph&#7847;n
c&#7913;ng có c&#7845;u hình th&#7845;p. Nên nó có th&#7875; &#273;&#432;&#7907;c
hi&#7879;n th&#7921;c hóa trên các máy &#273;i&#7879;n tho&#7841;i di &#273;&#7897;ng.</span></p>

<h2><a name="_Toc296332985"></a><a name="_Toc293406782"></a><a
name="_Toc288852019"></a><a name="_Toc293392670"></a><a name="_Toc293307419"></a><a
name="_Toc293305617"></a><a name="_Toc291771604"></a><a name="_Toc290651721"></a><a
name="_Toc288655305"></a><a name="_Toc287881674"></a><a name="_Toc287882851"></a><a
name="_Toc287864361"></a><a name="_Toc287847505"></a><a name="_Toc287777810"></a><a
name="_Toc287860736"></a><a name="_Toc287519562"></a><a name="_Toc287691736"></a><a
name="_Toc287459704"></a><a name="_Toc287445808"></a><a name="_1.2._M&#7909;c_tiêu"></a><span
style='layout-grid-mode:line'>1.2. M&#7909;c tiêu c&#7911;a &#273;&#7873; tài</span></h2>

<p class=MsoNormal style='text-indent:31.5pt'>V&#7899;i vi&#7879;c hi&#7875;u
&#273;&#432;&#7907;c nhu c&#7847;u c&#7847;n thi&#7871;t c&#7911;a mã dòng,
chúng tôi ti&#7871;n hành xây d&#7921;ng <b><i>ch&#432;&#417;ng trình th&#7917;
nghi&#7879;m s&#7917; d&#7909;ng mã dòng</i></b> d&#7921;a vào mã ngu&#7891;n m&#7903;
&#273;ã có, t&#7915; &#273;ó nh&#7853;n di&#7879;n ra các v&#7845;n &#273;&#7873;
nghiên c&#7913;u liên quan.</p>

<p class=MsoNormal style='text-indent:31.5pt'><span style='layout-grid-mode:
line'>Mã dòng là m&#7897;t ch&#7911; &#273;&#7873; nghiên c&#7913;u r&#7897;ng,
&#273;&#7847;y thách th&#7913;c, và &#273;ang &#273;&#432;&#7907;c các nhà
nghiên c&#7913;u mã quan tâm vì kh&#7843; n&#259;ng &#7913;ng d&#7909;ng quan
tr&#7885;ng c&#7911;a nó trên m&#7841;ng di &#273;&#7897;ng toàn c&#7847;u.
C&#417; s&#7903; lý thuy&#7871;t c&#7911;a mã dòng có liên quan v&#7899;i Lý
thuy&#7871;t s&#7889; [4] và lý thuy&#7871;t v&#7873; Tr&#432;&#7901;ng (c&#7909;
th&#7875; là tr&#432;&#7901;ng Galois hay Galoa), nên ch&#7855;c ch&#7855;n nó
t&#7853;n d&#7909;ng &#273;&#432;&#7907;c nh&#7919;ng ph&#432;&#417;ng pháp và
l&#7853;p lu&#7853;n m&#7841;nh c&#7911;a các l&#297;nh v&#7921;c toán h&#7885;c
này. &#272;ây là m&#7897;t &#273;i&#7875;m &#273;&#7847;y th&#7917; thách
nh&#432;ng c&#361;ng r&#7845;t thú v&#7883; &#273;&#7889;i v&#7899;i chúng tôi
khi nghiên c&#7913;u v&#7873; &#273;&#7873; tài này. V&#7899;i m&#7897;t mong
mu&#7889;n làm sáng t&#7887; nh&#7919;ng chân lý c&#7911;a c&#417; s&#7903; lý
thuy&#7871;t mã dòng, chúng tôi m&#7841;nh d&#7841;n &#273;&#7847;u t&#432;
công s&#7913;c &#273;&#7875; &#273;i sâu tìm hi&#7875;u nh&#7919;ng c&#417; s&#7903;
lý thuy&#7871;t mã dòng &#7845;y. Ph&#7847;n &#273;&#7847;u c&#7911;a lu&#7853;n
v&#259;n này trình bày nh&#7919;ng <b><i>c&#417; s&#7903; lý thuy&#7871;t và
các nguyên lý thi&#7871;t k&#7871; các mô hình c&#7911;a mã dòng.</i></b></span></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>Các
thu&#7853;t toán mã dòng th&#7921;c ch&#7845;t &#273;&#432;&#7907;c chia thành
hai thành ph&#7847;n trong ki&#7871;n trúc c&#7911;a nó. M&#7897;t thành ph&#7847;n
là quá trình làm vi&#7879;c c&#7911;a <i>b&#7897; sinh dòng khóa</i> (keystream
generator), và ph&#7847;n th&#7913; hai nh&#7853;n các <i>keystream</i>
&#273;&#432;&#7907;c sinh ra b&#7903;i b&#7897; sinh dòng khóa này &#273;&#7875;
ti&#7871;n hành công vi&#7879;c mã hóa (hay ch&#7913;ng th&#7921;c, &#273;&#7843;m
b&#7843;o tính toàn v&#7865;n) c&#7911;a mình. &#272;&#7889;i v&#7899;i các thu&#7853;t
toán mã dòng, ph&#7847;n th&#7913; hai này có th&#7875; ch&#7881; &#273;&#417;n
gi&#7843;n là th&#7921;c hi&#7879;n nhi&#7879;m v&#7909; XOR dòng khóa và b&#7843;n
rõ &#273;&#7875; t&#7841;o thành b&#7843;n mã. Do &#273;ó t&#7847;m quan tr&#7885;ng
c&#7911;a các thu&#7853;t toán mã dòng t&#7853;p trung ch&#7911; y&#7871;u vào
các generator [4]. Lu&#7853;n v&#259;n  &#273;i sâu phân tích <b><i>ki&#7871;n
trúc và c&#417; ch&#7871; ho&#7841;t &#273;&#7897;ng c&#7911;a các generator</i></b>
khác nhau.</span></p>

<p class=MsoNormal style='text-indent:.5in'><span style='layout-grid-mode:line'>&#272;&#7889;i
v&#7899;i m&#7897;t thu&#7853;t toán/mô hình m&#7853;t mã nói chung hay mã dòng
nói riêng, tính an toàn là y&#7871;u t&#7889; quan tr&#7885;ng hàng &#273;&#7847;u.
Do &#273;ó lu&#7853;n v&#259;n s&#7869; &#273;i sâu phân tích <b><i>các khía c&#7841;nh
m&#7853;t mã liên quan &#273;&#7871;n tính an toàn c&#7911;a mô hình mã dòng</i></b>.</span></p>

<p class=MsoNormal><span style='layout-grid-mode:line'>Lu&#7853;n v&#259;n tìm
hi&#7875;u <b><i>m&#7897;t s&#7889; mô hình mã dòng &#7913;ng d&#7909;ng trong
m&#7841;ng di &#273;&#7897;ng</i></b>. Trong &#273;ó bao g&#7891;m c&#7843; các
thu&#7853;t toán ch&#432;a &#273;&#432;&#7907;c công b&#7889; chính th&#7913;c &#7913;ng
d&#7909;ng trong m&#7841;ng di &#273;&#7897;ng cho nh&#7919;ng công ngh&#7879;
m&#7899;i, mà m&#7899;i ch&#7881; là nh&#7919;ng b&#7843;n th&#7843;o. &#272;i&#7875;n
hình là mã dòng ZUC [31] do </span><b>DACAS</b> (Trung tâm nghiên c&#7913;u an
toàn tuy&#7873;n thông và b&#7843;o m&#7853;t d&#7919; li&#7879;u c&#7911;a Vi&#7879;n
hàn lâm khoa h&#7885;c Trung Qu&#7889;c) thi&#7871;t k&#7871;<span
style='layout-grid-mode:line'>, lu&#7853;n v&#259;n s&#7869; &#273;i sâu phân
tích mô hình mã dòng này.</span></p>

<h2><a name="_Toc296332986"></a><a name="_Toc293406783"></a><a
name="_Toc293392671"></a><a name="_Toc293307420"></a><a name="_Toc293305618"></a><a
name="_1.3._Yêu_c&#7847;u"></a>1.3. <a name="_Toc288852020"></a><a
name="_Toc291771605"></a><a name="_Toc290651722"></a><a name="_Toc288655306"></a><a
name="_Toc287881675"></a><a name="_Toc287882852"></a><a name="_Toc287864362"></a><a
name="_Toc287847506"></a><a name="_Toc287777811"></a><a name="_Toc287860737"></a><a
name="_Toc287519563"></a><a name="_Toc287691737"></a><a name="_Toc287459705"></a><a
name="_Toc287445809"><span style='layout-grid-mode:line'>Yêu c&#7847;u</span></a>
c&#7911;a &#273;&#7873; tài<a name="_Toc291872556"></a><a name="_Toc292215726"></a><a
name="_Toc292215917"></a><a name="_Toc292219901"></a></h2>

<p class=MsoNormal>Nghiên c&#7913;u các c&#417; s&#7903; lý thuy&#7871;t c&#7911;a
mã dòng.</p>

<p class=MsoNormal>Phân tích, n&#7855;m rõ ki&#7871;n trúc và nguyên lý ho&#7841;t
&#273;&#7897;ng c&#7911;a các thu&#7853;t toán mã dòng và generator
t&#432;&#417;ng &#7913;ng.</p>

<p class=MsoNormal align=left style='text-align:left'><span style='layout-grid-mode:
line'>Tìm hi&#7875;u các mô hình mã dòng &#273;&#432;&#7907;c &#7913;ng d&#7909;ng
trong m&#7841;ng di &#273;&#7897;ng. Kh&#7843;o sát chi ti&#7871;t</span> mô
hình mã dòng <span style='layout-grid-mode:line'>ZUC.</span></p>

<p class=MsoNormal align=left style='text-align:left'>Hi&#7879;n th&#7921;c
ch&#432;&#417;ng trình minh h&#7885;a.</p>

<p class=MsoNormal align=left style='text-align:left'>Th&#7921;c nghi&#7879;m,
&#273;o &#273;&#7841;c các tính ch&#7845;t m&#7853;t mã quan tr&#7885;ng c&#7911;a
mô hình mã dòng ZUC.</p>

<h2><a name="_Toc296332987"></a><a name="_Toc293406784"></a><a
name="_Toc293392672"></a><a name="_Toc293307421"></a><a name="_Toc293305619"></a><a
name="_1.4._B&#7889;_c&#7909;c"></a><span style='layout-grid-mode:line'>1.4. <a
name="_Toc288852021"></a><a name="_Toc291771606"></a><a name="_Toc290651723"></a><a
name="_Toc288655307"></a><a name="_Toc287881676"></a><a name="_Toc287882853"></a><a
name="_Toc287864363"></a><a name="_Toc287847507"></a><a name="_Toc287777812"></a><a
name="_Toc287860738"></a><a name="_Toc287519564"></a><a name="_Toc287691738"></a><a
name="_Toc287459706"></a><a name="_Toc287445810">B&#7889; c&#7909;c lu&#7853;n
v&#259;n</a></span></h2>

<p class=MsoNormal>N&#7897;i dung c&#7911;a lu&#7853;n v&#259;n &#273;&#432;&#7907;c
trình bày g&#7891;m:</p>

<p class=MsoNormal><b>Ch&#432;&#417;ng 1. M&#7902; &#272;&#7846;U</b> trình bày
lý do c&#7847;n &#273;&#7871;n mã dòng hi&#7879;n nay trong th&#7921;c t&#7871;,
m&#7909;c tiêu th&#7921;c hi&#7879;n &#273;&#7873; tài mã dòng, &#273;&#7891;ng
th&#7901;i xác &#273;&#7883;nh &#273;&#432;&#7907;c các yêu c&#7847;u &#273;&#7863;t
ra c&#7911;a lu&#7853;n v&#259;n.</p>

<p class=MsoNormal><b>Ch&#432;&#417;ng 2. LÝ THUY&#7870;T MÃ DÒNG </b>trình bày
và h&#7879; th&#7889;ng hóa các ki&#7871;n th&#7913;c c&#259;n b&#7843;n c&#7911;a
mã dòng, &#273;&#7891;ng th&#7901;i so sánh s&#7921; khác nhau gi&#7919;a mã
dòng và mã kh&#7889;i, nêu ra các lo&#7841;i ki&#7871;n trúc mã dòng, các lo&#7841;i
b&#7897; sinh dòng khóa; gi&#7899;i thi&#7879;u l&#7841;i lý thuy&#7871;t v&#7873;
tr&#432;&#7901;ng h&#7919;u h&#7841;n (tr&#432;&#7901;ng Galois) &#273;óng vai
trò c&#417; s&#7903; toán h&#7885;c quan tr&#7885;ng &#273;&#7875; hi&#7875;u
rõ các khái ni&#7879;m liên quan &#273;&#7871;n mã dòng nh&#432;: dòng khóa
&#273;&#432;&#7907;c sinh ra b&#7903;i b&#7897; sinh, LFSR, S-box; trình bày
các khía c&#7841;nh m&#7853;t mã c&#7911;a dòng khóa: &#273;&#7897; ph&#7913;c
t&#7841;p tuy&#7871;n tính và &#273;a th&#7913;c c&#7921;c ti&#7875;u, phân ph&#7889;i
m&#7851;u, hàm t&#432;&#417;ng quan, &#273;&#7897; ph&#7913;c t&#7841;p c&#7847;u;
sau cùng là trình bày và h&#7879; th&#7889;ng ph&#7847;n r&#7845;t quan tr&#7885;ng,
&#273;ó là tính an toàn c&#7911;a mô hình mã dòng v&#7899;i các ý t&#432;&#7903;ng:
tính an toàn d&#7921;a vào ki&#7871;n trúc mã dòng, tính an toàn d&#7921;a vào
các khía c&#7841;nh m&#7853;t mã c&#7911;a dòng khóa, &#273;&#7863;c bi&#7879;t
là tính an toàn d&#7921;a vào ki&#7871;n trúc c&#7911;a b&#7897; sinh s&#7869;
&#273;i sâu phân tích và kh&#7843;o sát các &#273;&#7863;c tính m&#7853;t mã
quan tr&#7885;ng c&#7911;a hàm Boolean và S-box &#7843;nh h&#432;&#7899;ng
&#273;&#7871;n tính an toàn c&#7911;a b&#7897; sinh nh&#432;: tính phi tuy&#7871;n
(nonlinearity) và tiêu chu&#7849;n SAC (<span style='line-height:150%'>Strict
Avalanche Criterion</span>) c&#7911;a hàm Boolean, tính &#273;&#7891;ng nh&#7845;t
sai phân c&#7911;a S-box.</p>

<p class=MsoNormal><b>Ch&#432;&#417;ng 3. MÃ DÒNG TRÊN M&#7840;NG DI &#272;&#7896;NG</b>
trình bày gi&#7899;i thi&#7879;u v&#7873; m&#7841;ng di &#273;&#7897;ng và các
thu&#7853;t toán b&#7843;o m&#7853;t &#273;ã có trên m&#7841;ng di &#273;&#7897;ng;
trình bày l&#7841;i mô hình mã dòng ZUC và các &#7913;ng d&#7909;ng c&#7911;a
nó trong hai thu&#7853;t toán b&#7843;o m&#7853;t là: thu&#7853;t toán mã hóa
128-EEA3 và thu&#7853;t toán ch&#7913;ng th&#7921;c thông &#273;i&#7879;p
128-EIA3; trình bày các tiêu chu&#7849;n thi&#7871;t k&#7871; các l&#7899;p
(layer) trong c&#7845;u t&#7841;o c&#7911;a ZUC, &#273;&#7863;c bi&#7879;t
&#273;i sâu phân tích và th&#7921;c nghi&#7879;m &#273;o &#273;&#7841;c &#273;&#7875;
ki&#7875;m tra các &#273;&#7863;c tính m&#7853;t mã quan tr&#7885;ng c&#7911;a
hai S-box <i>S</i><sub>0</sub> và <i>S</i><sub>1</sub> trong hàm phi tuy&#7871;n
<i>F</i> là: tính phi tuy&#7871;n c&#7911;a S-box, tính &#273;&#7891;ng nh&#7845;t
sai phân c&#7911;a S-box, tiêu chu&#7849;n SAC và tính cân b&#7857;ng (balance)
c&#7911;a các hàm thành ph&#7847;n c&#7911;a S-box.</p>

<p class=MsoNormal><b>Ch&#432;&#417;ng 4. CH&#431;&#416;NG TRÌNH TH&#7920;C HI&#7878;N</b>
trình bày k&#7871;t qu&#7843; v&#7873; &#7913;ng d&#7909;ng th&#7917; nghi&#7879;m
Voice Chat, &#273;&#432;&#7907;c hi&#7879;n th&#7921;c thông qua thu&#7853;t
toán mã hóa 128-EEA3 dùng generator ZUC &#273;&#7875; &#273;&#7843;m b&#7843;o
bí m&#7853;t d&#7919; li&#7879;u trên &#273;&#432;&#7901;ng truy&#7873;n gi&#7919;a
nh&#7919;ng ng&#432;&#7901;i th&#7921;c hi&#7879;n cu&#7897;c h&#7897;i tho&#7841;i
v&#7899;i nhau; trình bày mô hình c&#7911;a &#7913;ng d&#7909;ng v&#7899;i các
yêu c&#7847;u ch&#7913;c n&#259;ng và mô hình ho&#7841;t &#273;&#7897;ng; th&#7921;c
nghi&#7879;m so sánh t&#7889;c &#273;&#7897; gi&#7919;a 128-EEA3 và AES; t&#7893;ng
k&#7871;t các k&#7871;t qu&#7843; &#273;&#7841;t &#273;&#432;&#7907;c và
ch&#432;a &#273;&#7841;t &#273;&#432;&#7907;c c&#7911;a ch&#432;&#417;ng trình
th&#7921;c hi&#7879;n.</p>

<p class=MsoNormal>&nbsp;</p>

<p class=MsoNormal><b>Ph&#7909; l&#7909;c A</b> trình bày m&#7897;t s&#7889;
&#273;&#7863;c tính m&#7853;t mã khác c&#7911;a hàm Boolean và c&#7911;a S-box &#7843;nh
h&#432;&#7899;ng &#273;&#7871;n tính an toàn c&#7911;a b&#7897; sinh là b&#7853;c
&#273;&#7841;i s&#7889; (<span lang=FR>algebraic degree</span>) và &#273;&#7897;
mi&#7877;n &#273;&#7841;i s&#7889; (<span lang=FR>algebraic immunity</span>).</p>

<p class=MsoNormal><b>Ph&#7909; l&#7909;c B</b> trình bày l&#7841;i c&#7845;u
trúc và s&#7921; an toàn c&#7911;a S-box trong thu&#7853;t toán mã kh&#7889;i
AES.</p>

<p class=MsoNormal><b>Ph&#7909; l&#7909;c C</b> trình bày m&#7897;t s&#7889;
khái ni&#7879;m khác nh&#432;: l&#432;&#7907;ng tin, các tiên &#273;&#7873; ng&#7851;u
nhiên Golomb.</p>

</div>

</body>

</html>
